import streamlit as st

st.sidebar.title("MATPLOTLIb")


st.title("Общая информация")




st.subheader(" Matplotlib - это библиотека на языке программирования Python "
         "для создания статических, анимированных и интерактивных визуализаций данных в виде графиков. "
         "Вот некоторые ключевые моменты:")
st.subheader("\n1. Графики и Визуализация Данных: Matplotlib предоставляет множество возможностей "
         "для создания различных видов графиков, включая линейные графики, столбчатые диаграммы, точечные графики, круговые диаграммы и т.д.")
st.subheader("\n2. Простота Использования: Благодаря, простому и понятному синтаксису Matplotlib широко используется как в академических, так и в "
         "промышленных целях. Он предоставляет гибкий контроль над внешним видом графиков.")

st.subheader("\n3. Интеграция С NumPy: Matplotlib легко интегрируется с библиотекой NumPy, что делает его мощным инструментом для визуализации данных, представленных в виде массивов NumPy.")
st.subheader("\n4. Поддержка Различных Форматов Вывода: Matplotlib позволяет сохранять графики в различных форматах, таких как PNG, JPEG, PDF и другие. Это полезно для встраивания графиков в документацию и презентации.")
st.subheader("\n5. Интерактивность: Можно создавать интерактивные графики, которые можно масштабировать, перемещать и добавлять всплывающие подсказки.")
st.subheader("\n6. Обширные Возможности Конфигурации: Можно настраивать практически все аспекты графика, включая цвета, метки, шрифты и другие.")


